## Assignment 02
 Date : 11/2/16

**Ques-1**  :  Explain the difference between a Python list and a NumPy array in terms of 
memory usage and performance.

Answer :

**List :** 
* collection of heterogeneous data types
* list store the reference of list objects/elements
* list objects  not stores in continuous memory location (may store on different location in memory)
* uses more memory
* slower performance for numeric operations

**Numpy Array :**
* collection of homogeneous data types
* stores actual data in the container
* stores at continuous memory location (same block of memory)
* uses low memory
* faster performance for numeric operations

In [11]:
! pip install numpy

Requirement already satisfied: numpy in C:\Users\91960\Desktop\Data Analytics\nk\Lib\site-packages (2.4.2)

In [12]:
## memory used by list and array
import sys
import numpy as np

lst = [1, 2, 3, 4, 5]
arr = np.array([1, 2, 3, 4, 5])

print("List memory:", sys.getsizeof(lst))  ## sys.getsizeof() returns the size of only list object/container not its elements
print("NumPy array memory:", arr.nbytes) ## arr.nbytes returns the size of actual data in numpy array

List memory: 104
NumPy array memory: 40

Then, write a program that creates both and performs element-wise 
multiplication.

In [78]:
## List multiplication 
lst1=list(range(100))
lst2=list(range(100))
# mul_lst=lst1*lst2  --> this gives the typeerror : can't multiply sequence by non-int of type 'list'
# for multiplication

mul_lst=[]
for i in range(len(lst1)):
    mul_lst.append(lst1[i] * lst2[i])
print("list multiplications : ",mul_lst)

list multiplications :  [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400, 441, 484, 529, 576, 625, 676, 729, 784, 841, 900, 961, 1024, 1089, 1156, 1225, 1296, 1369, 1444, 1521, 1600, 1681, 1764, 1849, 1936, 2025, 2116, 2209, 2304, 2401, 2500, 2601, 2704, 2809, 2916, 3025, 3136, 3249, 3364, 3481, 3600, 3721, 3844, 3969, 4096, 4225, 4356, 4489, 4624, 4761, 4900, 5041, 5184, 5329, 5476, 5625, 5776, 5929, 6084, 6241, 6400, 6561, 6724, 6889, 7056, 7225, 7396, 7569, 7744, 7921, 8100, 8281, 8464, 8649, 8836, 9025, 9216, 9409, 9604, 9801]

In [79]:
arr1=np.array(lst1)
arr2=np.array(lst2)
mul_arr = arr1 * arr2
print("array multiplication : ",mul_arr)

array multiplication :  [   0    1    4    9   16   25   36   49   64   81  100  121  144  169
  196  225  256  289  324  361  400  441  484  529  576  625  676  729
  784  841  900  961 1024 1089 1156 1225 1296 1369 1444 1521 1600 1681
 1764 1849 1936 2025 2116 2209 2304 2401 2500 2601 2704 2809 2916 3025
 3136 3249 3364 3481 3600 3721 3844 3969 4096 4225 4356 4489 4624 4761
 4900 5041 5184 5329 5476 5625 5776 5929 6084 6241 6400 6561 6724 6889
 7056 7225 7396 7569 7744 7921 8100 8281 8464 8649 8836 9025 9216 9409
 9604 9801]

**Ques-2** : What is broadcasting in NumPy? 
Create a 3×3 NumPy array and add a 1D array to it using broadcasting. Explain 
how NumPy applies the operation internally.

Answer : 

**Broadcasting in Numpy**
- allows arithmetic operation between different shapes of numpy array
- autonatically makes / expands smaller array for compatibility

In [39]:
## addition of 3-D array and 1-D array 
## remember number of columns must be same in both 3-D and 1-D array otherwise it gives error
arr_3D = np.array([[1,2,3],[4,5,6],[7,8,9]])  ## creates 3-D array([[row1],[row2],[row2]])
arr_1D = np.array([10,20,30])
add_arr = arr_3D + arr_1D
print("add using broadcasting : ",add_arr)

add using broadcasting :  [[11 22 33]
 [14 25 36]
 [17 28 39]]

Internal Operations using Broadcasting :
- 3-D array    = [ [1 2 3] [4 5 6] [7 8 9] ]
- 1-D array    = [ 10 20 30 ]
- practically this is not possible as both are of different dimensions
- but using broadcasting in numpy, it expands 1-D to 3-D
-   [ 10 20 30 ] --> [ [10 20 30] [10 20 30] [10 20 30] ]
- now addition is possible
-            [ [1  2  3]  [4  5  6]  [7  8  9] ]
-          + [ [10 20 30] [10 20 30] [10 20 30] ]
-          ---------------------------------------------
-            [ [11 22 33] [14 25 36] [17 28 39]]

**Ques-3** : What are missing values in Pandas and how are they represented?
- Create a DataFrame with missing values and write code to: 
    1. Detect missing values 
    2. Replace them with the column mean 
- Explain each step.

Answer : 
- **missing values** : absence of data in the tabel cell (intersection of row and column) or when data is not collected properly 
- **missing value representation** : NaN (Not a Number)

In [40]:
import pandas as pd

In [55]:
data = pd.read_csv(r"C:\Users\91960\Desktop\Data Analytics\Data_Analytics\Tasks\cust_satisfaction.csv")

Create Dataframe with missing values
- DataFrame -- > 2-D structure of data (table-format)
- - convert data into human readable form

In [56]:

data = pd.DataFrame(data)  
data

,Gender,Customer Type,Type of Travel,Class,satisfaction,Age,Flight Distance,Inflight entertainment,Baggage handling,Cleanliness,Departure Delay in Minutes,Arrival Delay in Minutes
0,Male,Loyal Customer,Personal Travel,Eco Plus,neutral or dissatisfied,13,460,5,4,5,25,18.0
1,Male,disloyal Customer,Business travel,Business,neutral or dissatisfied,25,235,1,3,1,1,6.0
2,Female,Loyal Customer,Business travel,Business,satisfied,26,1142,5,4,5,0,0.0
3,Female,Loyal Customer,Business travel,Business,neutral or dissatisfied,25,562,2,3,2,11,9.0
4,Male,Loyal Customer,Business travel,Business,satisfied,61,214,3,4,3,0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...
103899,Female,disloyal Customer,Business travel,Eco,neutral or dissatisfied,23,192,2,4,2,3,0.0
103900,Male,Loyal Customer,Business travel,Business,satisfied,49,2347,5,5,4,0,0.0
103901,Male,disloyal Customer,Business travel,Business,neutral or dissatisfied,30,1995,4,4,4,7,14.0
103902,Female,disloyal Customer,Business travel,Eco,neutral or dissatisfied,22,1000,1,1,1,0,0.0
103903,Male,Loyal Customer,Business travel,Business,neutral or dissatisfied,27,1723,1,4,1,0,0.0

Detect missing values
- check if there is missing value present or not in the dataset
  - True --> absence of value
  - False --> value present
- there are two function used to detect missing values in pandas : isna() and isnull() both are alias of each other

In [ ]:
data.isnull()

,Gender,Customer Type,Type of Travel,Class,satisfaction,Age,Flight Distance,Inflight entertainment,Baggage handling,Cleanliness,Departure Delay in Minutes,Arrival Delay in Minutes
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
103899,False,False,False,False,False,False,False,False,False,False,False,False
103900,False,False,False,False,False,False,False,False,False,False,False,False
103901,False,False,False,False,False,False,False,False,False,False,False,False
103902,False,False,False,False,False,False,False,False,False,False,False,False
103903,False,False,False,False,False,False,False,False,False,False,False,False

In [58]:
data.isnull().sum() # return count of missing values for each column

Gender                          0
Customer Type                   0
Type of Travel                  0
Class                           0
satisfaction                    0
Age                             0
Flight Distance                 0
Inflight entertainment          0
Baggage handling                0
Cleanliness                     0
Departure Delay in Minutes      0
Arrival Delay in Minutes      310
dtype: int64

Replace missing values with column mean:
- using fillna() we can replace missing values with any specified value

In [ ]:
# missing values are present in column 'Arrival Delay in Minutes'
data['Arrival Delay in Minutes'] = data['Arrival Delay in Minutes'].fillna(data['Arrival Delay in Minutes'].mean)

## fillna(value) is used to replace the missing value with specified value

In [ ]:
data.isnull().sum()
## as you see now there is no missing values in the datasets

Gender                        0
Customer Type                 0
Type of Travel                0
Class                         0
satisfaction                  0
Age                           0
Flight Distance               0
Inflight entertainment        0
Baggage handling              0
Cleanliness                   0
Departure Delay in Minutes    0
Arrival Delay in Minutes      0
dtype: int64

**Ques-4** : Explain boolean indexing in NumPy or Pandas. 
  Create a DataFrame with at least 5 columns and filter rows based on two conditions 
  using logical operators. Explain how filtering works internally.

Answer :
 **Boolean Indexing**: used to select rows of the data table using True and False condition
 - condition False --> row not selected
 - condition True --> row selected

In [62]:
emp_data = {
    'Name':['Neha','Sapna','Sakshi','Nisha'],
    'Age':[19,21,19,20],
    'Department':['CSE','EE','EE','CSE'],
    'Salary':[25000,35000,24000,37000],
    'Experience':[1,2,2,3]
}
emp_data=pd.DataFrame(emp_data)
emp_data

     Name  Age Department  Salary  Experience
0    Neha   19        CSE   25000           1
1   Sapna   21         EE   35000           2
2  Sakshi   19         EE   24000           2
3   Nisha   20        CSE   37000           3

filter rows using two conditions using logical operators

In [66]:
emp_data = emp_data[
    (emp_data['Experience']>=2) & # bitwise operator perform 'and' operation bit by bit and behaves as logical operator when operates on boolean series
    (emp_data['Salary']>=30000)
]
emp_data

    Name  Age Department  Salary  Experience
1  Sapna   21         EE   35000           2
3  Nisha   20        CSE   37000           3

In [ ]:
emp_data.query("Experience >=2 and Salary>=30000") ## query function using logical 'and' operations to filter row

    Name  Age Department  Salary  Experience
1  Sapna   21         EE   35000           2
3  Nisha   20        CSE   37000           3

Internal Working : 
- condition-1 : 
  - emp_data['Experience']>=2
    - it returns the boolean indexing series of experience column : <p style="color:green">[False,True,True,True]</p>
- condition-2 :
  - emp_data['Salary']>=30000
    - it returns boolean indexing series of salary column : <p style="color:green">[False,True,False,True]</p>   
- then perform & operations which behaves as logical operator when operates on boolean series 
  - (emp_data['Experience']>=2) & (emp_data['Salary']>=30000)
  - <p style="color:green">([False,True,True,True]) & ([False,True,False,True])</p>
    - now & operator compares each index of both boolean series like at index 0 both series has False then it also return False
    - so it return <p style="color:green">[False,True,False,True]</p>
    - now it uses the boolean indexing and select the rows(True-select,False-Cancel)
    - row 2 and 4 is selected
- output is shown above

**Ques-5** : What is the purpose of the groupby() function in Pandas? 
Create a DataFrame with categorical data (e.g., department & salary) and calculate 
the average salary per department using groupby(). Explain the output.

Answer : 
**groupby()** : groupby() is used to divide/split data into groups using some category or conditions and perform aggregation functions like mean,max,min,count

DataFrame with categorical data

In [69]:
Data = {
    "EmpID": ["Emp1","Emp2","Emp3","Emp4","Emp5",
             "Emp6","Emp7","Emp8","Emp9","Emp10",
             "Emp11","Emp12","Emp13","Emp14","Emp15"],

    "Department": ["HR","IT","Finance","IT","HR",
                   "Finance","IT","HR","IT","Finance",
                   "HR","IT","Finance","HR","IT"],

    "Salary": [40000, 60000, 50000, 65000, 42000,
               52000, 61000, 45000, 63000, 54000,
               43000, 67000, 56000, 46000, 62000]
}
df = pd.DataFrame(Data)
df

    EmpID Department  Salary
0    Emp1         HR   40000
1    Emp2         IT   60000
2    Emp3    Finance   50000
3    Emp4         IT   65000
4    Emp5         HR   42000
5    Emp6    Finance   52000
6    Emp7         IT   61000
7    Emp8         HR   45000
8    Emp9         IT   63000
9   Emp10    Finance   54000
10  Emp11         HR   43000
11  Emp12         IT   67000
12  Emp13    Finance   56000
13  Emp14         HR   46000
14  Emp15         IT   62000

calculate average(mean) salary of each group using groupby()

In [ ]:
avg_salary = df.groupby('Department') ## grouping based on category Department : groupby(category)
avg_salary['Salary'].mean() # mean function is used to find the mean
# df.groupby("Department")["Salary"].mean()

Department
Finance    53000.0
HR         43200.0
IT         63000.0
Name: Salary, dtype: float64

Working : 
 1. *df.groupby('Department')* splits the dataframe into the groups based on Departments (1-dataframe --> department groups)
 2. store each group view into variable 'avg_salary'
 3. now select the column of each group using 'avg_salary['Salary']'
 4. calculate the mean of salary for each group and return the mean value 'avg_salary['Salary'].mean()'